{"status":"ok","posts":[{"content":"<p><a href=\"http:\/\/ascentor.wordpress.com\/2012\/05\/24\/arturo-mayorga-lucid-dreams\/\" target=\"_blank\">Translated text &nbsp;by Sergey&nbsp;at Ascentor<\/a>&nbsp;below:<\/p>\n<p><a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=430\" rel=\"attachment wp-att-430\"><img class=\"alignleft size-thumbnail wp-image-430\" title=\"Headshot Outdoor\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/mail-2_2-116x150.jpg\" alt=\"\" height=\"150\" width=\"116\"><\/a>“The ambitious album, by the composer from El Paso, Arturo Mayorga, is able to surprise listeners, especially those who saw the cover of a piano. &nbsp;He immediately sets up a certain way. Arturo plays the piano, but does it not alone – his desire to create something really big leads into the studio a lot of musicians, forming a band (guitar, violin, oboe, percussion, with their powerful groove, cool relief bass).&nbsp; Mayorga’s talent quickly gets his special sound that is unmistakable, and who can not (and now the musicians are rarely forces on such large-scale “live” projects), it resembles many of the recent past.<\/p>\n<p>Arturo played the piano and as he demonstrates in the composition at the end of the album <a title=\"“If We Don’t, Who Will?” @ The White Plains Performing Arts Center\" href=\"http:\/\/arturomayorga.com\/site\/?p=418\">“If We Don’t, Who Will”<\/a> that he could successfully play the album solo, pouring into the ranks of the many performers. He chose a different path, creating a temperamental blend of jazz rhythms, orchestral arrangements, folk music (it is true, most grain, which is enough to feel the taste of Spanish flamenco) and typical moves the so-called “instrumental” music, it is difficult for an identifiable genre of “new age” which developed such groups as the James Last Orchestra. And yet there is little from the soundtrack to suit the scenes, when feelings are exposed, and the passion with a head covering.<\/p>\n<p>The name of the album is “Lucid Dreams”, it refers to the practices of New Age (which is among the supporters of such musical delights is easy to find loyal fans), but if he, Arturo, found inspiration in these border states of consciousness, then the listener to move to controlled levels of dreams are not <a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=393\" rel=\"attachment wp-att-393\"><img class=\"alignright size-thumbnail wp-image-393\" title=\"Lucid Dreams - Cover Art\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/183-6794075-6600956-150x150.jpg\" alt=\"Lucid Dreams - Cover Art\" height=\"150\" width=\"150\"><\/a>threatened – there are too many speakers, sensual energy, sincere romance and emotion. Look at “Lucid Dreams” and composition for a romantic evening (“Find Me Again” or committed a wonderful thing “Know It’s You”), and to set the mood (“Reflejos” its a little naive-youthful passion). Well, if you like, when the melancholy covers the head and leads to pure catharsis – please, “Serendipity”, with its tormented soul of a violin, which I would call a gypsy.<\/p>\n<p>This is a bright album, a fascinating, long time letting go. Recommended.<\/p>\n<p>&nbsp;<\/p>","excerpt":"<p><a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=430\" rel=\"attachment wp-att-430\"><img class=\"alignleft size-thumbnail wp-image-430\" title=\"Headshot Outdoor\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/mail-2_2-116x150.jpg\" alt=\"\" height=\"150\" width=\"116\"><\/a>“The ambitious album, by the composer from El Paso, Arturo Mayorga, is able to surprise listeners, especially those who saw the cover of a piano. &nbsp;He immediately sets up a certain way... ","title":"Sergey from Ascentor reviews Lucid Dreams","id":440,"url":"?p=440","categories":[{"id":0},{"id":4},{"id":5}]},{"content":"<p><a href=\"http:\/\/michaeldiamondmusic.com\/2012\/05\/23\/lucid-dreams-by-arturo-mayorga\/#more-1886\" target=\"_blank\">Quoted text<\/a> by Michael Diamond below:<\/p>\n<p>“CD: Lucid Dreams<br>\nArtist: Arturo Mayorga<br>\nContact: <a href=\"http:\/\/www.arturomayorga.com\" target=\"_blank\">www.arturomayorga.com<\/a><\/p>\n<p><a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=393\" rel=\"attachment wp-att-393\"><img class=\"alignleft size-thumbnail wp-image-393\" title=\"Lucid Dreams - Cover Art\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/183-6794075-6600956-150x150.jpg\" alt=\"Lucid Dreams - Cover Art\" height=\"150\" width=\"150\"><\/a>Arturo Mayorga has come a long way, literally, from growing up in El Paso, Texas to living in New York City, where he is currently making a name for himself as a recording artist. It’s also a long way from being a youngster where “piano lessons were not within reach,” to becoming an accomplished keyboardist playing along side some major league talent. As time went on, despite the lack of formal training, by the age of 14 he “had begun to see patterns in rhythm and harmony along with their consequent emotional effects.” It was during his time in high school orchestra that he learned how different instruments come together to produce complex sounds, which sparked a desire within him to write his own music.<\/p>\n<p>Although music remained near and dear to his heart, when it came time to go to college, he choose to study math and computer science – although not surprising coming from a family of engineers. His training has given him opportunities to work with a number of high tech companies including NASA. This interest in technology led him to learning about the recording process and he eventually released his first CD entitled Cascades, which received favorable reviews.<\/p>\n<p>His follow up album and latest release, Lucid Dreams, takes it to the next level. Arturo chose to work with one of the finest producer\/ engineers available: &nbsp;Grammy-award winner Corin Nelsen, who I am quite familiar with from his work with Windham Hill founder Will Ackerman among other projects. There are a number of other notable names on Lucid Dreams as well. I was impressed to see flute and sax-man, Lew Tabackin who has played with some of the biggest stars in jazz, both in big bands and small ensembles. I also recognized percussionist Jeff Haynes from The Pat Metheney Group. Another veteran of Will Ackerman studio sessions is Jill Haley on English horn and oboe. A number of other fine musicians, including the Attacca String Quartet, add their talents as well.<\/p>\n<p><a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=429\" rel=\"attachment wp-att-429\"><img class=\"alignright size-thumbnail wp-image-429\" title=\"Headshot BW\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/mail-5-99x150.jpg\" alt=\"\" height=\"150\" width=\"99\"><\/a>Airy flute and ambient synthesizer sounds create an atmospheric intro to the first track, entitled “Find Me Again.” &nbsp;The mood soon shifts as conga drums lay down a groove and Arturo’s piano takes command. I’m not sure exactly what it is about the chord progression he is playing, but I found it quite compelling. (A sample of this track, and others, can be found on the <a title=\"Music\" href=\"http:\/\/arturomayorga.com\/site\/?page_id=2\">“Music”<\/a> page of his website.) This is followed by a composition called “Mystery” that with its lush orchestration and blend of classical and new age overtones reminded me a bit of Yanni. After the relatively calm and pastoral feel of “Looking” with its wistful oboe melody, the grandeur, passion, and drama of the next track, “Serendipity” created a yin\/yang contrast. This piece, which features the string quartet, could work quite well as a film soundtrack.<\/p>\n<p>A standout track, for me, is the upbeat Latin-tinged “Reflejos” which showcases the tasteful Spanish guitar playing of David Cullen. In another yin\/yang comparison, the following track, “You Know It’s You,” is a lovely ballad that highlights Arturo’s skill as an arranger. I also very much enjoyed the next to the last track entitled “Within A Glimpse” which begins with solo piano and adds other instruments as it evolves, building in depth and complexity before coming back to the solo piano at the end. In addition to Arturo’s flair for arranging, I’m also quite impressed with his skill as a pianist and his ability to play with grace and subtlety as well as with tremendous power and passion. It seems that I’m not the only one who finds a lot to like in Arturo’s music, asLucid Dreams opened in the top spot for the April 2012 ZMR Top 100 radio charts. I believe that he has chosen wisely in working with a top-flight producer\/engineer and highly talented accompanists to bring out the shine and sparkle of his well-conceived compositions. If Lucid Dreams is any indication, I’m sure there will be many more sweet dreams in Arturo’s future.<a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=428\" rel=\"attachment wp-att-428\"><img class=\"aligncenter size-thumbnail wp-image-428\" title=\"High-rise Piano\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/site-150x111.jpg\" alt=\"\" height=\"111\" width=\"150\"><\/a><\/p>","excerpt":"<p><a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=393\" rel=\"attachment wp-att-393\"><img class=\"alignleft size-thumbnail wp-image-393\" title=\"Lucid Dreams - Cover Art\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/183-6794075-6600956-150x150.jpg\" alt=\"Lucid Dreams - Cover Art\" height=\"150\" width=\"150\"><\/a>Arturo Mayorga has come a long way, literally, from growing up in El Paso, Texas to living in New York City, where he is currently making a name for himself as a recording artist...<\/p>","title":"Review from Music & Media Focus - Lucid Dreams","id":434,"url":"?p=434","categories":[{"id":0},{"id":4},{"id":5}]},{"content":"<p style=\"text-align: left;\" align=\"center\">This is a review by&nbsp;Raj Manoharan of&nbsp;<a href=\"http:\/\/www.rajmanreviews.blogspot.com\/\" target=\"_blank\">www.rajmanreviews.blogspot.com<\/a>.<\/p>\n<p style=\"text-align: left;\" align=\"center\"><a href=\"http:\/\/www.rajmanreviews.blogspot.com\/2012\/05\/cd-review-lucid-dreams-by-arturo.html\" target=\"_blank\">Original text<\/a> quoted below:<\/p>\n<p align=\"center\">“CD&nbsp;Review&nbsp;–&nbsp;<em>Lucid Dreams,&nbsp;<\/em>by Arturo Mayorga<\/p>\n<p style=\"text-align: left;\" align=\"center\"><img class=\"alignright size-thumbnail wp-image-424\" title=\"DSC_0064_2\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/DSC_0064_2-150x115.jpg\" alt=\"\" height=\"115\" width=\"150\">Arturo Mayorga presents a collection of eleven tunes that accomplish what good music does – take listeners’ minds off their cares and transport them to a place of inspiration and enlightenment.<\/p>\n<p>The pianist\/keyboardist alternates between solo tracks, duets, and a full ensemble. The rich sound is achieved by a full consort of musicians on <a href=\"http:\/\/www.cullenguitar.com\/\" target=\"_blank\">guitar<\/a>, <a href=\"http:\/\/www.irishusa.com\/holley\/\" target=\"_blank\">drums<\/a>, <a href=\"http:\/\/jeffhaynesmusic.com\/\" target=\"_blank\">percussion<\/a>, <a href=\"http:\/\/www.lewtabackin.com\/\" target=\"_blank\">flute<\/a>, <a href=\"http:\/\/www.jillhaley.com\/\" target=\"_blank\">oboe, English horn<\/a>, <a href=\"http:\/\/www.danielehager.com\/\" target=\"_blank\">voice<\/a>, <a href=\"http:\/\/attaccaquartet.com\/\" target=\"_blank\">violin, viola, and cello<\/a>.<\/p>\n<p>Mayorga is a master of his craft, constructing snappy compositions around his fine, pointed melodies. He has an acute understanding of pop sensibilities that makes his music accessible to listeners of every stripe.<\/p>\n<p>This is an enjoyable CD that is engaging from beginning to end.<\/p>\n<p>-Raj<\/p>","excerpt":"<p style=\"text-align: left;\" align=\"center\"><img class=\"alignright size-thumbnail wp-image-424\" title=\"DSC_0064_2\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/DSC_0064_2-150x115.jpg\" alt=\"\" height=\"115\" width=\"150\">Arturo Mayorga presents a collection of eleven tunes that accomplish what good music does – take listeners’ minds off their cares and transport them...<\/p>","title":"Lucid Dreams - CD Review By Raj Manoharan","id":423,"url":"?p=423","categories":[{"id":0},{"id":4},{"id":5}]},{"content":"<p\/><div class=\"embed-container\"><iframe src=\"http:\/\/www.youtube.com\/embed\/aj-IRTF2eOo\" frameborder=\"0\" height=\"auto\" width=\"100%\"><\/iframe><\/div>\n<p>Arturo Mayorga performing ‘If We Don’t, Who Will?’ from the album ‘Lucid Dreams’ @ The White Plains Performing Arts Center for the ‘We Sing For Team Donovan’ benefit concert.<\/p>\n<p>We Sing For Team Donovan was organized by We Sing For The World in partnership with The White Plains Performing Arts Center.<\/p>\n<p>Download this track from <a href=\"http:\/\/itunes.apple.com\/us\/album\/if-we-dont-who-will\/id514977457?i=514977538&amp;uo=4\" target=\"itunes_store\"><img style=\"border: 0;\" src=\"http:\/\/r.mzstatic.com\/images\/web\/linkmaker\/badge_itunes-sm.gif\" alt=\"If We Don't, Who Will - Lucid Dreams\"><\/a><\/p>\n<p>Get it at <a href=\"http:\/\/www.amazon.com\/gp\/product\/B007PW0RI6\/ref=as_li_ss_tl?ie=UTF8&amp;tag=artumayodotco-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B007PW0RI6\">Amazon<img style=\"border: none !important; margin: 0px !important;\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=artumayodotco-20&amp;l=as2&amp;o=1&amp;a=B007PW0RI6\" alt=\"\" height=\"1\" width=\"1\" border=\"0\"><\/a><\/p>\n<p>Listen for free through Spotify: <iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify:track:0tOqzuogMjcahxvYQkttgO\" frameborder=\"0\" height=\"auto\" width=\"100%\"><\/iframe><\/p>","excerpt":"<div class=\"embed-container\"><iframe src=\"http:\/\/www.youtube.com\/embed\/aj-IRTF2eOo\" frameborder=\"0\" height=\"auto\" width=\"100%\"><\/iframe><\/div>","title":"If We Don't, Who Will?","id":418,"url":"?p=418","categories":[{"id":0},{"id":6}]}]}