{"status":"ok","posts":[{"content":"<p>Here is a review of Lucid Dreams by Amazon Hall of Fame Reviewer&nbsp;<a title=\"Lee Armstrong\" href=\"http:\/\/www.amazon.com\/review\/RY28ECD79AYLX\">Lee Armstrong<\/a>.<\/p>\n<p>“Holy smokes! This CD is hot! Arturo Mayorga’s “Lucid Dreams” shows an artist with powerful musical sense that translates into emotionally gripping instrumental pieces. As both pianist and composer, he enlists a number of talented emotions and fleshes out his arrangements with guitar, flutes, drums, oboe, English horn, violin, viola and cello. The mix is stunning. Two of the tracks are my very favorites. On “Mystery” Mayorga’s piano speaks elegantly and vibrantly perhaps of bravely and hopefully venturing out into the unknown despite uncertainties. The strings come in, not sappy, but giving an emotional panorama. I hope you’ll give it a play. The other piece that amazes me is “Serendipity,” an anthem that makes me flash on epic films like “Lord of the Rings.” After the main theme is established, the viola (maybe violin) comes in sounding like an Eastern European folk tune. Then Mayorga tops it with strong piano and strings. What an exquisite track! Other tracks like “Eastern Pulse,” the gorgeous “One More Day” and “Within a Glimpse” are gems. He ends the set with the only solo piano piece on the set, the lovely “If We Don’t, Who Will?” This is not the kind of new age music that you use as a sleep aid. It’s intense, challenging, beautiful and ultimately emotionally satisfying. Enjoy!<\/p>","excerpt":"<p>“Holy smokes! This CD is hot! Arturo Mayorga’s “Lucid Dreams” shows an artist with powerful musical sense that translates into emotionally gripping instrumental pieces. As both pianist and composer, he enlists a number of talented emotions and fleshes out his arrangements with guitar, flutes, drums, oboe, English horn, violin, viola and cello. The mix is stunning. Two of the tracks are my very favorites...<\/p>","title":"Lee Armstrong reviews Lucid Dreams","id":184,"url":"?p=184","categories":[{"id":0},{"id":4},{"id":5}]},{"content":"<p>Some people have asked about getting a signed copy of Arturo’s new album. This is a unique opportunity to be amongst the first to own a unique signed copy of “Cascades”. Each copy sold here will be signed and numbered by Arturo, making each of them a unique collector’s item.<\/p>\n<p>Cascades will be released on May 30 but pre-order today and get a signed and numbered copy of the album!<\/p>\n<p>Place your order here.<\/p>","excerpt":"<p>Some people have asked about getting a signed copy of Arturo’s new album. This is a unique opportunity to be amongst the first to own a unique signed copy of “Cascades”. Each copy sold here will be signed and numbered by Arturo, making each of them a unique collector’s item.<\/p>\n<p>Cascades will be released on May 30...<\/p>","title":"Pre-order your 'Cascades' CD today!","id":113,"url":"?p=113","categories":[{"id":0},{"id":4}]},{"content":"<p>Kathy Parsons from <a href=\"http:\/\/www.mainlypiano.com\">MainlyPiano.com<\/a> was kind enough to review Cascades.  <a href=\"http:\/\/www.mainlypiano.com\/Older_Reviews_M-O\/Mayorga-Cascades.html\">Here is what she had to say<\/a>:<\/p>\n<p>Cascades\nArturo Mayorga\n2009 \/ Arturo Mayorga<\/p>\n<p>47’29”\n“Cascades” is the debut recording from pianist\/composer Arturo Mayorga. Most of the ten tracks are piano with keyboard orchestration and embellishments, and several indicate a strong influence from Yanni. There is a variety of moods in the pieces – some are soft and romantic while others are darker and more powerful – indicating that Mayorga has a good range of styles. “Cascades” is a very strong debut even though it is a little heavy on the synth strings.<\/p>\n<p>“Sunrise” begins the album with a hushed sense of mystery. As the piece evolves, it becomes more colorful and melodic while maintaining a mood of calm optimism. The title track picks up the tempo a bit. The left hand plays a flowing accompaniment to the lovely melody while gentle percussion and string washes in the background add dimension. “Painting On Silence” has a very strong influence from Yanni’s “In My Time” era – graceful, smooth, and melodic. “Lone Walk” is a favorite. Darker and more melancholy, this one reminds me of Dax Johnson in places. Piano, strings, and percussion are evocative and moody. “In-Side Change” is also on the dark, pensive side, and voices join the instrumental mix. It’s a beautiful piece, but I’m not crazy about the solo violin (keyboard). “Nocturne No. 2” takes a more classical turn and is solo piano. I really like “Secret Life,” which also has hints of Yanni. Upbeat and rhythmic, it is one of the more joyous pieces on the album. “Water Dance” is another favorite. A bit more ambient for the first two minutes, the haunting flute casts a quiet spell. Then the piano comes in, swirling and dancing. Eventually, the flute returns along with strings, creating a joyous celebration.<\/p>\n<p>“Cascades” is a strong and promising first album from Arturo Mayorga, a musician who obviously loves what he’s doing. It is available from www.arturomayorga.com, cdbaby.com, amazon.com (download), and iTunes. Have a listen!<\/p>\n<p>Kathy Parsons<\/p>\n<p><a href=\"http:\/\/www.mainlypiano.com\">MainlyPiano.com<\/a><\/p>","excerpt":"<p>47’29”\n“Cascades” is the debut recording from pianist\/composer Arturo Mayorga. Most of the ten tracks are piano with keyboard orchestration and embellishments, and several indicate a strong influence from Yanni. There is a variety of moods in the pieces – some are soft and romantic while others are darker and more powerful – indicating that Mayorga...<\/p>","title":"Cascades review by Kathy Parsons (MainlyPiano.com)","id":103,"url":"?p=103","categories":[{"id":0},{"id":4},{"id":5}]},{"content":"<p>We are very happy to announce that composer Arturo Mayorga has dedicated the theme song “If We Don’t Who Will” to We Sing For The World!<\/p>","excerpt":"<p>We are very happy to announce that composer Arturo Mayorga has dedicated the theme song “If We Don’t Who Will” to We Sing For The World!<\/p>","title":"If We Don't Who Will","id":96,"url":"?p=96","categories":[{"id":0},{"id":4}]}]}