{"status":"ok","posts":[{"content":"<p><a href=\"http:\/\/www.newagemusicworld.com\/tag\/arturo-mayorga\/\">Quoted<\/a> text below:<\/p>\n<p>“Arturo Mayorga is recognized as a dancing pianist but don’t get me wrong, Arturo does not literally dance while playing piano. However if he were to attempt this feat, I am certain it would be as graceful and dignified as what I have heard in his first classic New Age piano CD.<\/p>\n<p>Equal to his talents as a composing musician, Arturo Mayorga is nationally ranked in the competitive sport of Ballroom dancing, where Waltz, Tango, and Swing are scrutinized before watchful judges who watch for the accepted criteria of a dancing couple locked hand in hand. Now with a concert piano as his partner, Cascades embraces the identical movements found in classical dance by having a choreography timed with proper speed, motion, and balance.<\/p>\n<p>Like so many musicians, a parent’s considerate gift of a musical instrument at an early age is what began his interest in music. Arturo states that it was at this early age that he realized the impact of what one person playing an instrument could have on another. Arturo continued music through high school then college. His scholastic studies were in math and science, but composing music was also on his mind so he started the framework songs for the Cascades album during this time period. While judging this CD for myself, I found the 10 classic piano songs of varying moods left me feeling they were a personal revelation of his emotional thoughts put to music.<\/p>\n<p>Cascades begins with first song Sunrise. This mid tempo piano and violin duet sets the standard for a graceful heartfelt ballet, where each timed movement is balanced by the piano melody considering violin takes a second seat by following the lead. There is much emotional content since a melancholy feel is present, lending to a touch of sadness, yet adding character and definition, leaving a beautiful image of what you have just heard in your mind.<\/p>\n<p>The Last Night of Winter aligns well with the piano’s duo partner in allowing violin to take the lead in portion of the melody during this faster paced song, where full 360 degree rotational dance pivots, and those brief stationary pauses always see during pivot turns, can be pictured in your mind if you try.\nThe title song Cascades is a true champion in freestyle, where a faster tempo piano promenades with every rise and fall in piano key note steps, reaching the full height in posture, rhythm, and speed.<\/p>\n<p>Violin notes then connects with the melody posturing in a more formal manner while piano strokes sweep along the keyboard at a dizzying pace. The positive upbeat piano movements seem to sweep you off your feet at critical moments, leaving you breathless at the finish.<\/p>\n<p>Arturo is successful at engraving a full range of emotional content and movement into his classic orchestra style music. Cascades is a wonderful piano and instrumental album with beautiful rhythm.<\/p>\n<p>Knowing Arturo Mayorga’s background in dance, one can easily imagine themselves sitting in the audience watching him in motion while listening to his music. From where I happen to be sitting, Arturo appears to be a winner.\"<\/p>","excerpt":"<p><a href=\"http:\/\/www.newagemusicworld.com\/tag\/arturo-mayorga\/\">Quoted<\/a> text below:<\/p>\n<p>“Arturo Mayorga is recognized as a dancing pianist but don’t get me wrong, Arturo does not literally dance while playing piano. However if he were to attempt this feat, I am certain it would be as graceful and dignified as what I have heard in his first classic New Age piano CD...\"<\/p>","title":"John P. Olsen (www.NewAgeMusicWorld.com) reviews Cascades","id":"245","url":"?p=245","categories":[{"id":0},{"id":4},{"id":5}]},{"content":"<h1>hyperion-renderer<\/h1>\n<p>The aim of...<\/p>\n<h1>Build and Deployment<\/h1>\n<ol>\n<li>Download<\/li>\n<li>Point<\/li>\n<li>Open  <\/li>\n<\/ol>\n<h1>Contributing<\/h1>\n<ol>\n<li>Get <\/li>\n<li>Fork <\/li>\n<li>Make<\/li>\n<li>Submit<\/li>\n<\/ol>","excerpt":"<h1>hyperion-renderer<\/h1>\n<p>The aim of the project is to create an object-oriented 3D rendering system which abstracts the und....<\/p>","title":"This is a sample title","id":"1","url":"?p=1","categories":[{"id":0},{"id":6},{"id":1},{"id":3}]}]}