{"status":"ok","post":{"content":"<p>Here is a review of Lucid Dreams by Amazon Hall of Fame Reviewer&nbsp;<a title=\"Lee Armstrong\" href=\"http:\/\/www.amazon.com\/review\/RY28ECD79AYLX\">Lee Armstrong<\/a>.<\/p>\n<p>“Holy smokes! This CD is hot! Arturo Mayorga’s “Lucid Dreams” shows an artist with powerful musical sense that translates into emotionally gripping instrumental pieces. As both pianist and composer, he enlists a number of talented emotions and fleshes out his arrangements with guitar, flutes, drums, oboe, English horn, violin, viola and cello. The mix is stunning. Two of the tracks are my very favorites. On “Mystery” Mayorga’s piano speaks elegantly and vibrantly perhaps of bravely and hopefully venturing out into the unknown despite uncertainties. The strings come in, not sappy, but giving an emotional panorama. I hope you’ll give it a play. The other piece that amazes me is “Serendipity,” an anthem that makes me flash on epic films like “Lord of the Rings.” After the main theme is established, the viola (maybe violin) comes in sounding like an Eastern European folk tune. Then Mayorga tops it with strong piano and strings. What an exquisite track! Other tracks like “Eastern Pulse,” the gorgeous “One More Day” and “Within a Glimpse” are gems. He ends the set with the only solo piano piece on the set, the lovely “If We Don’t, Who Will?” This is not the kind of new age music that you use as a sleep aid. It’s intense, challenging, beautiful and ultimately emotionally satisfying. Enjoy!<\/p>","excerpt":"<p>“Holy smokes! This CD is hot! Arturo Mayorga’s “Lucid Dreams” shows an artist with powerful musical sense that translates into emotionally gripping instrumental pieces. As both pianist and composer, he enlists a number of talented emotions and fleshes out his arrangements with guitar, flutes, drums, oboe, English horn, violin, viola and cello. The mix is stunning. Two of the tracks are my very favorites...<\/p>","title":"Lee Armstrong reviews Lucid Dreams","id":184,"url":"?p=184","categories":[{"id":0},{"id":4},{"id":5}]}}