{"status":"ok","post":{"content":"<p><a href=\"http:\/\/ascentor.wordpress.com\/2012\/05\/24\/arturo-mayorga-lucid-dreams\/\" target=\"_blank\">Translated text &nbsp;by Sergey&nbsp;at Ascentor<\/a>&nbsp;below:<\/p>\n<p><a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=430\" rel=\"attachment wp-att-430\"><img class=\"alignleft size-thumbnail wp-image-430\" title=\"Headshot Outdoor\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/mail-2_2-116x150.jpg\" alt=\"\" height=\"150\" width=\"116\"><\/a>“The ambitious album, by the composer from El Paso, Arturo Mayorga, is able to surprise listeners, especially those who saw the cover of a piano. &nbsp;He immediately sets up a certain way. Arturo plays the piano, but does it not alone – his desire to create something really big leads into the studio a lot of musicians, forming a band (guitar, violin, oboe, percussion, with their powerful groove, cool relief bass).&nbsp; Mayorga’s talent quickly gets his special sound that is unmistakable, and who can not (and now the musicians are rarely forces on such large-scale “live” projects), it resembles many of the recent past.<\/p>\n<p>Arturo played the piano and as he demonstrates in the composition at the end of the album <a title=\"“If We Don’t, Who Will?” @ The White Plains Performing Arts Center\" href=\"http:\/\/arturomayorga.com\/site\/?p=418\">“If We Don’t, Who Will”<\/a> that he could successfully play the album solo, pouring into the ranks of the many performers. He chose a different path, creating a temperamental blend of jazz rhythms, orchestral arrangements, folk music (it is true, most grain, which is enough to feel the taste of Spanish flamenco) and typical moves the so-called “instrumental” music, it is difficult for an identifiable genre of “new age” which developed such groups as the James Last Orchestra. And yet there is little from the soundtrack to suit the scenes, when feelings are exposed, and the passion with a head covering.<\/p>\n<p>The name of the album is “Lucid Dreams”, it refers to the practices of New Age (which is among the supporters of such musical delights is easy to find loyal fans), but if he, Arturo, found inspiration in these border states of consciousness, then the listener to move to controlled levels of dreams are not <a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=393\" rel=\"attachment wp-att-393\"><img class=\"alignright size-thumbnail wp-image-393\" title=\"Lucid Dreams - Cover Art\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/183-6794075-6600956-150x150.jpg\" alt=\"Lucid Dreams - Cover Art\" height=\"150\" width=\"150\"><\/a>threatened – there are too many speakers, sensual energy, sincere romance and emotion. Look at “Lucid Dreams” and composition for a romantic evening (“Find Me Again” or committed a wonderful thing “Know It’s You”), and to set the mood (“Reflejos” its a little naive-youthful passion). Well, if you like, when the melancholy covers the head and leads to pure catharsis – please, “Serendipity”, with its tormented soul of a violin, which I would call a gypsy.<\/p>\n<p>This is a bright album, a fascinating, long time letting go. Recommended.<\/p>\n<p>&nbsp;<\/p>","excerpt":"<p><a href=\"http:\/\/arturomayorga.com\/site\/?attachment_id=430\" rel=\"attachment wp-att-430\"><img class=\"alignleft size-thumbnail wp-image-430\" title=\"Headshot Outdoor\" src=\"http:\/\/arturomayorga.com\/site\/wp-content\/uploads\/2012\/05\/mail-2_2-116x150.jpg\" alt=\"\" height=\"150\" width=\"116\"><\/a>“The ambitious album, by the composer from El Paso, Arturo Mayorga, is able to surprise listeners, especially those who saw the cover of a piano. &nbsp;He immediately sets up a certain way... ","title":"Sergey from Ascentor reviews Lucid Dreams","id":440,"url":"?p=440","categories":[{"id":0},{"id":4},{"id":5}]}}